In [6]:
import numpy as np

s = np.random.normal(size = 1500)
b = np.arange(-4, 5)
h = np.histogram(s, bins = b, density = True)[0]

In [8]:
bins = 0.5 * (b[1:] + b[:-1])
from scipy import stats

pdf = stats.norm.pdf(bins)

In [11]:
print(bins)

[-3.5 -2.5 -1.5 -0.5  0.5  1.5  2.5  3.5]

In [12]:
loc, std = stats.norm.fit(s)
print(loc, std)

-0.0049297475817221175 0.978518474272796

In [13]:
np.mean(s)

-0.0049297475817221175

In [14]:
np.median(s)

-0.027288248002864116

In [16]:
import pandas as pd

a1 = np.array([14,75, 90.55, 55.99, 25.7])
s1 = pd.Series(a1)

In [17]:
type(s1)

pandas.core.series.Series

In [32]:
names = ['Greater London', 'Tokyo', 'Paris', 'New York']

population = [8663300, 9272565, 2229621, 8491079]

area = [1572, 627, 105, 784]

In [33]:
df = pd.DataFrame({'cities': names, 'population': population, 'area': area})

In [34]:
type(df)

pandas.core.frame.DataFrame

df.head(2)

In [35]:
df.tail(2)

     cities  population  area
2     Paris     2229621   105
3  New York     8491079   784

In [36]:
df.dtypes

cities        object
population     int64
area           int64
dtype: object

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   cities      4 non-null      object
 1   population  4 non-null      int64
 2   area        4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [38]:
df.columns

Index(['cities', 'population', 'area'], dtype='object')

In [39]:
df['population'][2:4]

2    2229621
3    8491079
Name: population, dtype: int64

In [40]:
df[['cities', 'area']][0:1]

           cities  area
0  Greater London  1572

In [41]:
df.set_index('cities', inplace=True)

In [42]:
df.loc['Tokyo']

population    9272565
area              627
Name: Tokyo, dtype: int64

In [43]:
df.loc['Greater London', 'population']

8663300

In [44]:
df.describe()

         population         area
count  4.000000e+00     4.000000
mean   7.164141e+06   772.000000
std    3.306720e+06   607.195191
min    2.229621e+06   105.000000
25%    6.925714e+06   496.500000
50%    8.577190e+06   705.500000
75%    8.815616e+06   981.000000
max    9.272565e+06  1572.000000

In [45]:
df['pop_density'] = df['population']/df['area']

In [46]:
df

                population  area   pop_density
cities
Greater London     8663300  1572   5511.005089
Tokyo              9272565   627  14788.779904
Paris              2229621   105  21234.485714
New York           8491079   784  10830.457908